mfo/20240322161707-mfo_primeiras_especificacoes.org
:PROPERTIES:
:ID:       cab6973d-bb75-49d8-8abc-70f4ba04953c
:END:
#+title:     Primeiras Especificações
#+EMAIL:     gabrielamoreira05@gmail.com
#+DATE:      09 de abril de 2025
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil \n:t @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:not-in-toc
#+BEAMER_FRAME_LEVEL: 2
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [smaller]
#+BEAMER_THEME: udesc
#+BEAMER_HEADER: \input{header.tex} \subtitle{Aula para disciplina de Métodos Formais} \institute{Departamento de Ciência da Computação - DCC\\Universidade do Estado de Santa Catarina - UDESC}
#+LATEX_COMPILER: pdflatex
#+bibliography: references.bib
#+cite_export: csl ~/MEGA/csl/associacao-brasileira-de-normas-tecnicas.csl

#+HTML: <a href="https://bugarela.com/mfo/slides/20240322161707-mfo_primeiras_especificacoes.pdf">Slides</a><br />
#+beamer: \begin{frame}{Conteúdo}
#+TOC: headlines 3
#+beamer: \end{frame}

* REPL
** Usando a REPL
x' = x + 1 na REPL
#+BEAMER: \pause
#+BEAMER: \medskip

#+begin_src quint
>>> var x: int

>>> x' = 0
true
>>> x
0
>>> action step = x' = x + 1

>>> step
true
>>> step
true
>>> x
2
#+end_src

** PS: Definições aninhadas
Sempre podemos definir operadores, valores e ações dentro do próprio corpo de outra definição. Semelhante ao =let= do Haskell.
- Para isso, basta escrever a(s) definição(ões) seguidas por fim da expressão final a ser retornada.
  - Sem separar com vírgula!
#+begin_src quint
pure def f(x) = {
  pure def quadrado(y) = y * y
  pure def dobro(y) = 2 * y
  quadrado(x) + dobro(x)
}
#+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
As chaves ={}= são opcionais, e você pode usar elas quando quiser pra deixar mais claro o escopo, por exemplo:
#+begin_src quint
val foo = pure def f(x) = 2 * x { f(5) }
#+end_src

* Ações em Quint
** Ações
Ações são expressões booleanas que podem incluir o operador /primed/ (='=).

#+BEAMER: \pause
#+BEAMER: \medskip
Contudo, não podemos usar os operadores booleanos normais sobre essa expressão. Quint não permite isso para evitar possíveis confusões. Por exemplo, as seguintes operações *não* são permitidas:
- =not(x' = 1)=
- =x' = 1 or x' = 2=
- =x' > 1 and x' < 2=
- =Set(1, 2, 3).exists(i ==> x' = i)=

#+BEAMER: \pause
#+BEAMER: \medskip
Os equivalentes em TLA+ são permitidos. Em Quint, somos forçados a escrever as ações de um jeito específico, de uma forma que elas não possam ser confundidas com não-ações.
** all e any
- Em vez de =and=, usamos =all=
  #+begin_src quint
  action incrementa_x_e_y = all {
    x' = x + 1,
    y' = y + 1,
  }
  #+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
- Em vez de =or=, usamos =any=
  #+begin_src quint
  action incrementa_ou_decrementa_x = any {
    x' = x + 1,
    x' = x - 1,
  }
  #+end_src

** nondet e oneOf
- Em vez de =exists=, usamos =nondet= e =oneOf=
  #+begin_src quint
  action x_recebe_algum_valor = {
    nondet valor = Set(1, 2, 3).oneOf()
    x' = valor
  }
  #+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
- Importante: O =oneOf= só pode ser usado nesse cenário (dentro de uma ação, em uma definição do tipo =nondet=, sem operações adicionais sobre ele).
  #+BEAMER: \pause
  - A syntaxe em Quint é dessa forma para deixar o não-determinismo explícito, mas na lógica (TLA), isso ainda é um =exists=.
  #+BEAMER: \pause
  - Por exemplo, não é possível usar o =oneOf= na implementação de uma função, i.e. para encontrar o máximo em um conjunto.

** if também pode ser usado em ações
- O =if= não tem uma versão especial pra ações. Usamos ele normalmente.
  #+begin_src quint
  action incrementa_x_se_par = {
    if (x % 2 == 0) {
      x' = x + 1
    } else {
      x' = x
    }
  }
  #+end_src

** Balanceamento de atualizações
Todas as ações em Quint devem ser devidamente balanceadas, e uma variável nunca pode ser atualizada mais de uma vez em uma mesma ação.

#+BEAMER: \pause
#+BEAMER: \medskip
Isso significa que:
- Todas as ações em um =any= devem atualizar as mesmas variáveis
#+BEAMER: \pause
- Em um =if=, os blocos =then= e =else= devem atualizar as mesmas variáveis
#+BEAMER: \pause
- Em um =all=, as variáveis atualizadas por cada ação não podem se repetir

#+BEAMER: \pause
#+BEAMER: \medskip
Essas restrições valem pra TLA+ também, mas em TLA+ isso só será detectado na hora de rodar o /model checker/. Em Quint, vocês vão ver sublinhados vermelhos no editor.

