docs/mfo/20240322161707-mfo_primeiras_especificacoes.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Primeiras Especificações</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="http://nowhere.org/mfo/20240322161707-mfo_primeiras_especificacoes.html" />
  <meta property="og:title" content="Primeiras Especificações" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Primeiras Especificações">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Primeiras Especificações</h2>
        <a href="https://bugarela.com/mfo/slides/20240322161707-mfo_primeiras_especificacoes.pdf">Slides</a><br />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org37e965c">1. Correção exercícios</a>
<ul>
<li><a href="#orgcb24549">1.1. Definições aninhadas</a></li>
<li><a href="#orgfc2d557">1.2. Correção dos exercícios</a></li>
</ul>
</li>
<li><a href="#org6a755fa">2. REPL</a>
<ul>
<li><a href="#org69e98ba">2.1. Usando a REPL</a></li>
</ul>
</li>
<li><a href="#orgcea3814">3. Ações em Quint</a>
<ul>
<li><a href="#org4463d4d">3.1. Ações</a></li>
<li><a href="#org6efcba5">3.2. all e any</a></li>
<li><a href="#org39aefa7">3.3. nondet e oneOf</a></li>
<li><a href="#org550a190">3.4. <code>if</code> também pode ser usado em ações</a></li>
<li><a href="#org21be5f1">3.5. Balanceamento de atualizações</a></li>
<li><a href="#org8c5d41e">3.6. Exemplos desbalanceados</a></li>
<li><a href="#orgdc8c0b4">3.7. Exemplos com múltiplas atualizações da mesma variável</a></li>
</ul>
</li>
<li><a href="#orgefa86c3">4. Modos de Quint</a>
<ul>
<li><a href="#orga445daf">4.1. Modos de Quint</a></li>
<li><a href="#org4875fae">4.2. Definição dos modos</a></li>
</ul>
</li>
<li><a href="#org39da5dc">5. Jarros de Água</a>
<ul>
<li><a href="#org4bdd05f">5.1. Exercício - Jarros de Água</a></li>
<li><a href="#orga0f0ae1">5.2. Variáveis</a></li>
<li><a href="#org6b3f83b">5.3. Ações</a></li>
<li><a href="#orgb147282">5.4. Estado inicial</a></li>
<li><a href="#org5ef3fdd">5.5. Tentando resolver na REPL</a></li>
<li><a href="#org6257083">5.6. Ação de próximo estado e invariante</a></li>
<li><a href="#orgce05610">5.7. Encontrando um contraexemplo</a></li>
</ul>
</li>
<li><a href="#org91f881a">6. Runs</a>
<ul>
<li><a href="#orga849985">6.1. Runs</a></li>
<li><a href="#org5f996ee">6.2. Definindo uma run para a solução dos jarros</a></li>
<li><a href="#org8c65b7a">6.3. Rodando runs como testes</a></li>
<li><a href="#orgf408171">6.4. Invocando runs na REPL</a></li>
<li><a href="#org956893b">6.5. FIM</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org37e965c" class="outline-2">
<h2 id="org37e965c"><span class="section-number-2">1.</span> Correção exercícios</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcb24549" class="outline-3">
<h3 id="orgcb24549"><span class="section-number-3">1.1.</span> Definições aninhadas</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Sempre podemos definir operadores, valores e ações dentro do próprio corpo de outra definição. Semelhante ao <code>let</code> do Haskell.<br />
</p>
<ul class="org-ul">
<li>Para isso, basta escrever a(s) definição(ões) seguidas por fim da expressão final a ser retornada.<br />
<ul class="org-ul">
<li>Sem separar com vírgula!<br /></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">def</span> f(x) = {
  <span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">def</span> quadrado(y) = y * y
  <span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">def</span> dobro(y) = 2 * y
  quadrado(x) + dobro(x)
}
</pre>
</div>

<p>
As chaves <code>{}</code> são opcionais, e você pode usar elas quando quiser pra deixar mais claro o escopo, por exemplo:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">val</span> foo = <span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">def</span> f(x) = 2 * x { f(5) }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc2d557" class="outline-3">
<h3 id="orgfc2d557"><span class="section-number-3">1.2.</span> Correção dos exercícios</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Vamos corrigir juntos usando a REPL.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org6a755fa" class="outline-2">
<h2 id="org6a755fa"><span class="section-number-2">2.</span> REPL</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org69e98ba" class="outline-3">
<h3 id="org69e98ba"><span class="section-number-3">2.1.</span> Usando a REPL</h3>
<div class="outline-text-3" id="text-2-1">
<p>
x&rsquo; = x + 1 na REPL<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">&gt;&gt;&gt; <span style="color: #e35b15;">var</span> x: <span style="color: #d79921;">int</span>

&gt;&gt;&gt; x' = 0
<span style="color: #805b87;">true</span>
&gt;&gt;&gt; x
0
&gt;&gt;&gt; <span style="color: #e35b15;">action</span> step = x' = x + 1

&gt;&gt;&gt; step
<span style="color: #805b87;">true</span>
&gt;&gt;&gt; step
<span style="color: #805b87;">true</span>
&gt;&gt;&gt; x
2
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcea3814" class="outline-2">
<h2 id="orgcea3814"><span class="section-number-2">3.</span> Ações em Quint</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4463d4d" class="outline-3">
<h3 id="org4463d4d"><span class="section-number-3">3.1.</span> Ações</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Ações são expressões booleanas que podem incluir o operador <i>primed</i> (<code>'</code>).<br />
</p>

<p>
Contudo, não podemos usar os operadores booleanos normais sobre essa expressão. Quint não permite isso para evitar possíveis confusões. Por exemplo, as seguintes operações <b>não</b> são permitidas:<br />
</p>
<ul class="org-ul">
<li><code>not(x' = 1)</code><br /></li>
<li><code>x' = 1 or x' = 2</code><br /></li>
<li><code>x' &gt; 1 and x' &lt; 2</code><br /></li>
<li><code>Set(1, 2, 3).exists(i ==&gt; x' = i)</code><br /></li>
</ul>

<p>
Os equivalentes em TLA+ são permitidos. Em Quint, somos forçados a escrever as ações de um jeito específico, de uma forma que elas não possam ser confundidas com não-ações.<br />
</p>
</div>
</div>
<div id="outline-container-org6efcba5" class="outline-3">
<h3 id="org6efcba5"><span class="section-number-3">3.2.</span> all e any</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
Em vez de <code>and</code>, usamos <code>all</code><br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> incrementa_x_e_y = <span style="color: #66a4a4;">all</span> {
    x' = x + 1,
    y' = y + 1,
  }
</pre>
</div></li>
</ul>

<ul class="org-ul">
<li><p>
Em vez de or, usamos any<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> incrementa_ou_decrementa_x = <span style="color: #66a4a4;">any</span> {
    x' = x + 1,
    x' = x - 1,
  }
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org39aefa7" class="outline-3">
<h3 id="org39aefa7"><span class="section-number-3">3.3.</span> nondet e oneOf</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><p>
Em vez de <code>exists</code>, usamos <code>nondet</code> e <code>oneOf</code><br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> x_recebe_algum_valor = {
    <span style="color: #e35b15;">nondet</span> valor = <span style="color: #d79921;">Set</span>(1, 2, 3).oneOf()
    x' = valor
  }
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org550a190" class="outline-3">
<h3 id="org550a190"><span class="section-number-3">3.4.</span> <code>if</code> também pode ser usado em ações</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><p>
O <code>if</code> não tem uma versão especial pra ações. Usamos ele normalmente.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> incrementa_x_se_par = {
    <span style="color: #66a4a4;">if</span> (x % 2 == 0) {
      x' = x + 1
    } <span style="color: #66a4a4;">else</span> {
      x' = x
    }
  }
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org21be5f1" class="outline-3">
<h3 id="org21be5f1"><span class="section-number-3">3.5.</span> Balanceamento de atualizações</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Todas as ações em Quint devem ser devidamente balanceadas, e uma variável nunca pode ser atualizada mais de uma vez em uma mesma ação.<br />
</p>

<p>
Isso significa que:<br />
</p>
<ul class="org-ul">
<li>Todas as ações em um <code>any</code> devem atualizar as mesmas variáveis<br /></li>
</ul>
<ul class="org-ul">
<li>Em um <code>if</code>, os blocos <code>then</code> e <code>else</code> devem atualizar as mesmas variáveis<br /></li>
</ul>
<ul class="org-ul">
<li>Em um <code>all</code>, as variáveis atualizadas por cada ação não podem se repetir<br /></li>
</ul>

<p>
Essas restrições valem pra TLA+ também, mas em TLA+ isso só será detectado na hora de rodar o <i>model checker</i>. Em Quint, vocês vão ver sublinhados vermelhos no editor.<br />
</p>
</div>
</div>
