mfo/20240322161707-mfo_primeiras_especificacoes.org
** Exemplos desbalanceados
Os exemplos a seguir *não* são permitidos no Quint. PS: Para vê-los no editor, você precisa declarar as variáveis (=var x: int= e =var y: int=).
#+begin_src quint
action any_desbalanceado = any {
  x' = 1,
  y' = 2,
}

action if_desbalanceado = {
  if (x > 0) {
    x' = 1
  } else {
    y' = 2
  }
}
#+end_src

** Exemplos com múltiplas atualizações da mesma variável
Os exemplos a seguir *não* são permitidos no Quint.
#+begin_src quint
action all_multiplas_atualizacoes = all {
  x' = 1,
  x' = 2,
}

action a1 = x' = 1
action a2 = x' = 2
action all_multiplas_atualizacoes = all { a1, a2 }
#+end_src

* Modos de Quint
** Modos de Quint
:PROPERTIES:
:CUSTOM_ID: modos-de-quint-2
:END:
Percebam como nas últimas aulas conversamos sobre coisas um tanto diferentes:
- Aula passada, definimos
    - *operadores* com =def= e =pure def=
    - *valores* com =val= e =pure val=
- Nessa aula, usaremos ações com =action=

** Definição dos modos
Primeiramente, temos a diferença entre =val= e =def=
- =val= (ou =pure val=): Valores, onde não há nenhum parâmetro.
- =def= (ou =pure def=): Operadores, onde há pelo menos um parâmetro.

#+BEAMER: \pause
#+BEAMER: \medskip
Esses são os *modos* das definições. Eles definem o tanto de acesso que as definições tem às variáveis.
- =pure def= e =pure val=: Nenhum acesso. Como funções puras, onde o mesmo input vai sempre gerar o mesmo output.
- =def= e =val=: Leitura.
- =action=: Escrita e Leitura.

#+BEAMER: \pause
#+BEAMER: \medskip
Além destes, temos alguns modos adicionais:
- =nondet=: Para declarações com não determinismo (que usam =oneOf=).
- =temporal=: Para fórmulas temporais.
- =run=: Para execuções mais específicas, permitindo operadores que ajudam a definir o passo a passo esperado.

* Jarros de Água
** Exercício - Jarros de Água
- Você tem dois jarros:
  1. um grande, com capacidade de 5 litros
  2. um pequeno, com capacidade de 3 litros

- Você tem uma torneira de água com capacidade infinita
- Você pode descartar água a qualquer momento
- É possível, com precisão, ter uma medida de 4 litros de água?

** Variáveis
#+begin_src quint
module jarros {
  var grande: int
  var pequeno: int

  ...
}
#+end_src

** Ações
  :PROPERTIES:
  :CUSTOM_ID: acoes-2-2
  :END:
Tente escrever as ações abaixo, definindo os valores para =grande= e =pequeno= em cada uma delas. Nenhuma dessas ações precisa de parâmetros.
#+begin_src quint
  action enche_grande
  action enche_pequeno
  action esvazia_grande
  action esvazia_pequeno
  action grande_pro_pequeno
  action pequeno_pro_grande
#+end_src

** Estado inicial
#+begin_src quint
  action init = all {
    grande' = 0,
    pequeno' = 0,
  }
#+end_src

** Tentando resolver na REPL
#+begin_src shell
quint -r jarros.qnt::jarros
#+end_src

Comece com =init=, e verifique os valores de =grande= e =pequeno=. Depois, tente invocar as outras ações, lembrando que o objetivo é chegar em um estado onde um dos jarros tem 4 litros.

** Ação de próximo estado e invariante
Agora, vamos usar o /model checker/ para encontrar a solução. Para isso, vamos definir:
- =step=, a ação de próximo estado. A cada passo, podemos tomar qualquer uma das ações definidas.
- =inv=, nossa invariante. Nesse caso, esperamos que a invariante seja quebrada, para obter nossa solução como contraexemplo.

#+begin_src quint
  action step = any {
    enche_grande,
    enche_pequeno,
    esvazia_grande,
    esvazia_pequeno,
    grande_pro_pequeno,
    pequeno_pro_grande,
  }

  val inv = grande != 4
#+end_src

** Encontrando um contraexemplo
#+begin_src quint
$ quint verify jarros.qnt --invariant=inv
An example execution:

[State 0] { grande: 0, pequeno: 0 }
[State 1] { grande: 5, pequeno: 0 }
[State 2] { grande: 2, pequeno: 3 }
[State 3] { grande: 2, pequeno: 0 }
[State 4] { grande: 0, pequeno: 2 }
[State 5] { grande: 5, pequeno: 2 }
[State 6] { grande: 4, pequeno: 3 }

[violation] Found an issue (156ms).
error: found a counterexample
#+end_src

* Runs
** Runs
- Representação de uma *execução* finita.
  - Pode ser uma execução concreta, ou
  - Pode ter não determinismo, representando mais de uma execução
- Descreve como reproduzir uma ou mais execuções, se possível

#+BEAMER: \pause
#+BEAMER: \medskip
Essa é uma feature exclusiva do Quint, e não há uma representação equivalente em TLA+.
- Em TLA+, só podemos usar o estado em si para determinar cada passo a ser dado.
- Em Quint, as runs permitem definir isso externamente, sem necessidade de manipular o estado.

#+BEAMER: \pause
#+BEAMER: \medskip
O propósito de runs está relacionado a testes, e não tem função alguma para o /model checker/.

** Definindo uma run para a solução dos jarros
#+begin_src quint
  run solution =
    init
      .then(enche_grande)
      .then(grande_pro_pequeno)
      .then(esvazia_pequeno)
      .then(grande_pro_pequeno)
      .then(enche_grande)
      .then(grande_pro_pequeno)
      .expect(grande == 4)
#+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
Adicionando o =expect= no final, essa run também funciona como um teste

