docs/mfo/20240322161707-mfo_primeiras_especificacoes.html
<div id="outline-container-org8c5d41e" class="outline-3">
<h3 id="org8c5d41e"><span class="section-number-3">3.6.</span> Exemplos desbalanceados</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Os exemplos a seguir <b>não</b> são permitidos no Quint. PS: Para vê-los no editor, você precisa declarar as variáveis (<code>var x: int</code> e <code>var y: int</code>).<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">action</span> any_desbalanceado = <span style="color: #66a4a4;">any</span> {
  x' = 1,
  y' = 2,
}

<span style="color: #e35b15;">action</span> if_desbalanceado = {
  <span style="color: #66a4a4;">if</span> (x &gt; 0) {
    x' = 1
  } <span style="color: #66a4a4;">else</span> {
    y' = 2
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc8c0b4" class="outline-3">
<h3 id="orgdc8c0b4"><span class="section-number-3">3.7.</span> Exemplos com múltiplas atualizações da mesma variável</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Os exemplos a seguir <b>não</b> são permitidos no Quint.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">action</span> all_multiplas_atualizacoes = <span style="color: #66a4a4;">all</span> {
  x' = 1,
  x' = 2,
}

<span style="color: #e35b15;">action</span> a1 = x' = 1
<span style="color: #e35b15;">action</span> a2 = x' = 2
<span style="color: #e35b15;">action</span> all_multiplas_atualizacoes = <span style="color: #66a4a4;">all</span> { a1, a2 }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgefa86c3" class="outline-2">
<h2 id="orgefa86c3"><span class="section-number-2">4.</span> Modos de Quint</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga445daf" class="outline-3">
<h3 id="orga445daf"><span class="section-number-3">4.1.</span> Modos de Quint</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Percebam como nas últimas aulas conversamos sobre coisas um tanto diferentes:<br />
</p>
<ul class="org-ul">
<li>Aula passada, definimos<br />
<ul class="org-ul">
<li><b>operadores</b> com <code>def</code> e <code>pure def</code><br /></li>
<li><b>valores</b> com <code>val</code> e <code>pure val</code><br /></li>
</ul></li>
<li>Nessa aula, usaremos ações com <code>action</code><br /></li>
</ul>
</div>
</div>
<div id="outline-container-org4875fae" class="outline-3">
<h3 id="org4875fae"><span class="section-number-3">4.2.</span> Definição dos modos</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Primeiramente, temos a diferença entre <code>val</code> e <code>def</code><br />
</p>
<ul class="org-ul">
<li><code>val</code> (ou <code>pure val</code>): Valores, onde não há nenhum parâmetro.<br /></li>
<li><code>def</code> (ou <code>pure def</code>): Operadores, onde há pelo menos um parâmetro.<br /></li>
</ul>

<p>
Esses são os <b>modos</b> das definições. Eles definem o tanto de acesso que as definições tem às variáveis.<br />
</p>
<ul class="org-ul">
<li><code>pure def</code> e <code>pure val</code>: Nenhum acesso. Como funções puras, onde o mesmo input vai sempre gerar o mesmo output.<br /></li>
<li><code>def</code> e <code>val</code>: Leitura.<br /></li>
<li><code>action</code>: Escrita e Leitura.<br /></li>
</ul>

<p>
Além destes, temos alguns modos adicionais:<br />
</p>
<ul class="org-ul">
<li><code>nondet</code>: Para declarações com não determinismo (que usam <code>oneOf</code>).<br /></li>
<li><code>temporal</code>: Para fórmulas temporais.<br /></li>
<li><code>run</code>: Para execuções mais específicas, permitindo operadores que ajudam a definir o passo a passo esperado.<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org39da5dc" class="outline-2">
<h2 id="org39da5dc"><span class="section-number-2">5.</span> Jarros de Água</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4bdd05f" class="outline-3">
<h3 id="org4bdd05f"><span class="section-number-3">5.1.</span> Exercício - Jarros de Água</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Você tem dois jarros:<br />
<ol class="org-ol">
<li>um grande, com capacidade de 5 litros<br /></li>
<li>um pequeno, com capacidade de 3 litros<br /></li>
</ol></li>

<li>Você tem uma torneira de água com capacidade infinita<br /></li>
<li>Você pode descartar água a qualquer momento<br /></li>
<li>É possível, com precisão, ter uma medida de 4 litros de água?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga0f0ae1" class="outline-3">
<h3 id="orga0f0ae1"><span class="section-number-3">5.2.</span> Variáveis</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">module</span> jarros {
  <span style="color: #e35b15;">var</span> grande: <span style="color: #d79921;">int</span>
  <span style="color: #e35b15;">var</span> pequeno: <span style="color: #d79921;">int</span>

  ...
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6b3f83b" class="outline-3">
<h3 id="org6b3f83b"><span class="section-number-3">5.3.</span> Ações</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Tente escrever as ações abaixo, definindo os valores para <code>grande</code> e <code>pequeno</code> em cada uma delas. Nenhuma dessas ações precisa de parâmetros.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> enche_grande
  <span style="color: #e35b15;">action</span> enche_pequeno
  <span style="color: #e35b15;">action</span> esvazia_grande
  <span style="color: #e35b15;">action</span> esvazia_pequeno
  <span style="color: #e35b15;">action</span> grande_pro_pequeno
  <span style="color: #e35b15;">action</span> pequeno_pro_grande
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb147282" class="outline-3">
<h3 id="orgb147282"><span class="section-number-3">5.4.</span> Estado inicial</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> init = <span style="color: #66a4a4;">all</span> {
    grande' = 0,
    pequeno' = 0,
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ef3fdd" class="outline-3">
<h3 id="org5ef3fdd"><span class="section-number-3">5.5.</span> Tentando resolver na REPL</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-shell">quint -r jarros.qnt::jarros
</pre>
</div>

<p>
Comece com <code>init</code>, e verifique os valores de <code>grande</code> e <code>pequeno</code>. Depois, tente invocar as outras ações, lembrando que o objetivo é chegar em um estado onde um dos jarros tem 4 litros.<br />
</p>
</div>
</div>
<div id="outline-container-org6257083" class="outline-3">
<h3 id="org6257083"><span class="section-number-3">5.6.</span> Ação de próximo estado e invariante</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Agora, vamos usar o <i>model checker</i> para encontrar a solução. Para isso, vamos definir:<br />
</p>
<ul class="org-ul">
<li><code>step</code>, a ação de próximo estado. A cada passo, podemos tomar qualquer uma das ações definidas.<br /></li>
<li><code>inv</code>, nossa invariante. Nesse caso, esperamos que a invariante seja quebrada, para obter nossa solução como contraexemplo.<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-quint">  <span style="color: #e35b15;">action</span> step = <span style="color: #66a4a4;">any</span> {
    enche_grande,
    enche_pequeno,
    esvazia_grande,
    esvazia_pequeno,
    grande_pro_pequeno,
    pequeno_pro_grande,
  }

  <span style="color: #e35b15;">val</span> inv = grande != 4
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce05610" class="outline-3">
<h3 id="orgce05610"><span class="section-number-3">5.7.</span> Encontrando um contraexemplo</h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-quint">$ quint verify jarros.qnt --invariant=inv
An example execution:

[State 0] { grande: 0, pequeno: 0 }
[State 1] { grande: 5, pequeno: 0 }
[State 2] { grande: 2, pequeno: 3 }
[State 3] { grande: 2, pequeno: 0 }
[State 4] { grande: 0, pequeno: 2 }
[State 5] { grande: 5, pequeno: 2 }
[State 6] { grande: 4, pequeno: 3 }

[violation] Found an issue (156ms).
error: found a counterexample
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org91f881a" class="outline-2">
<h2 id="org91f881a"><span class="section-number-2">6.</span> Runs</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga849985" class="outline-3">
<h3 id="orga849985"><span class="section-number-3">6.1.</span> Runs</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Representação de uma <b>execução</b> finita.<br />
<ul class="org-ul">
<li>Pode ser uma execução concreta, ou<br /></li>
<li>Pode ter não determinismo, representando mais de uma execução<br /></li>
</ul></li>
<li>Descreve como reproduzir uma ou mais execuções, se possível<br /></li>
</ul>

<p>
Essa é uma feature exclusiva do Quint, e não há uma representação equivalente em TLA+.<br />
</p>
<ul class="org-ul">
<li>Em TLA+, só podemos usar o estado em si para determinar cada passo a ser dado.<br /></li>
<li>Em Quint, as runs permitem definir isso externamente, sem necessidade de manipular o estado.<br /></li>
</ul>

<p>
O propósito de runs está relacionado a testes, e não tem função alguma para o <i>model checker</i>.<br />
</p>
</div>
</div>
<div id="outline-container-org5f996ee" class="outline-3">
<h3 id="org5f996ee"><span class="section-number-3">6.2.</span> Definindo uma run para a solução dos jarros</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-quint">  run solution =
    init
      .then(enche_grande)
      .then(grande_pro_pequeno)
      .then(esvazia_pequeno)
      .then(grande_pro_pequeno)
      .then(enche_grande)
      .then(grande_pro_pequeno)
      .expect(grande == 4)
</pre>
</div>

<p>
Adicionando o <code>expect</code> no final, essa run também funciona como um teste<br />
</p>
</div>
</div>
