mfo/20240322161707-mfo_primeiras_especificacoes.org
** Rodando runs como testes
#+begin_src shell
quint test jarros.qnt --match solution

  jarros
    ok solution passed 1 test(s)

  1 passing (12ms)
#+end_src

** Invocando runs na REPL
#+begin_src quint
$ quint -r jarros.qnt::jarros
>>> solution
true
>>> grande
4
>>> pequeno
3
#+end_src

** FIM
#+BEAMER: \maketitle
