docs/mfo/20240322161707-mfo_primeiras_especificacoes.html
<div id="outline-container-org8c65b7a" class="outline-3">
<h3 id="org8c65b7a"><span class="section-number-3">6.3.</span> Rodando runs como testes</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-shell">quint test jarros.qnt --match solution

  jarros
    ok solution passed <span style="color: #d79921; font-weight: bold;">1</span> test<span style="color: #66a4a4;">(</span>s<span style="color: #66a4a4;">)</span>

  <span style="color: #d79921; font-weight: bold;">1</span> passing <span style="color: #66a4a4;">(</span>12ms<span style="color: #66a4a4;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf408171" class="outline-3">
<h3 id="orgf408171"><span class="section-number-3">6.4.</span> Invocando runs na REPL</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-quint">$ quint -r jarros.qnt::jarros
&gt;&gt;&gt; solution
<span style="color: #805b87;">true</span>
&gt;&gt;&gt; grande
4
&gt;&gt;&gt; pequeno
3
</pre>
</div>
</div>
</div>
<div id="outline-container-org956893b" class="outline-3">
<h3 id="org956893b"><span class="section-number-3">6.5.</span> FIM</h3>
<div class="outline-text-3" id="text-6-5">
</div>
</div>
</div>

      </div>
    </div>
  </body>
</html>
